{
  "title":{
    "0":"Lad wrote a Python script to download Alexa voice recordings, he didn't expect this email.",
    "1":"This post has:",
    "2":"I redesign the Python logo to make it more modern",
    "3":"Automate the boring stuff with python - tinder",
    "4":"Just finished programming and building my own smart mirror in python, wrote all of the code myself and implemented my own voice control and facial recognition features",
    "5":"I'm excited to share my first published book, Introduction to Python Programming for Business and Social Science Applications -- specifically geared towards students not specifically in computer science",
    "6":"Drawing Mona Lisa with 256 circles using evolution [Github repo in comments]",
    "7":"I made a simulation using Python in which a neural network learns to race",
    "8":"Thanks to everyone’s advice, my mouse drawing algorithm has gotten much better and faster!",
    "9":"Debugging Cheat Sheet",
    "10":"Just trying to create a orbit system in python and this happened...",
    "11":"Dev'ing an app to help visualize data from any matplotlib figure",
    "12":"I've designed brand new cheatsheets (x2) and handouts (x3) for matplotlib",
    "13":"I am a medical student, and I recently programmed an open-source eye-tracker for brain research",
    "14":"MS is considering official Python integration with Excel, and is asking for input",
    "15":"Python 3 in One Pic",
    "16":"I've made a 3D scanner that's fully automated using Python script on Android phone!",
    "17":"I made a little program that mutes spotify ads because i dont have the money to get premium . Not anything special but i think its quite neat. Any ideas on cool python projects i can build ?",
    "18":"The only way to satisfy a programmer on his birthday!",
    "19":"Happy Holidays! Made a user-directed greeting card using Python Turtle Graphics",
    "20":"Python's response to MATLAB",
    "21":"Laid off for 8 weeks. Anyone else starting their python journey?",
    "22":"[Beginner’s Guide] How to start programming in Python",
    "23":"Python Cheet Sheet for begineers",
    "24":"A Python GUI for uninstalling the default Windows 10 apps.",
    "25":"A tool that copies a selected area of your screen, not as a picture, but as pastable text (GitHub in comments)",
    "26":"Python project that answers high-school problems almost instantly. Made using Tesseract, Scrapy and Flask.",
    "27":"Thought this looked familiar...",
    "28":"PrettyErrors, a module to format exception reports",
    "29":"Finished a program that draws images with epicycles!",
    "30":"Python in a nutshell (Had to do it)",
    "31":"I wrote a Python program to play Google Dinosaur Game using Gesture Recognition",
    "32":"I made an AI opponent for lesser known board game - Chain Reaction. Apparently, it plays better than me!",
    "33":"End-to-End Self Driving Car - Need For Speed",
    "34":"My Professor wants hand written assignments. So I made MyhandWriting.. that can write in myway on a A4 sheet paper.",
    "35":"So I made a Python and Arduino project that dynamically changes sets the ambient lighting to match the computed dominant color values from the wallpapers.",
    "36":"I am excited to share my 8th published book, Python 101, geared for beginners and intermediate level readers",
    "37":"This great message",
    "38":"Made an annoying Python script that sends a friend on Facebook Messenger the Shrek movie word by word",
    "39":"I'm developing a game with Python and Pygame!",
    "40":"I made an Instagram Bot to make DeepFakes for everyone! @deepfake.maker",
    "41":"I finished my Python Ray Tracer capable of rendering refraction and thin film interference!",
    "42":"This post has",
    "43":"Made a Screen Dimmer based on Facial Recognition with OpenCV and AppleScript!",
    "44":"A Program that acts as an \"invisibility cloak\"... It camouflages any person\/object that appears in front of the camera.... Sorry for the colour jittering🙈",
    "45":"We started late, but we managed to leave Python footprint on r\/place!",
    "46":"An update on Python 4",
    "47":"hashtags",
    "48":"Got my first job as a developer!",
    "49":"Recursively flipping and rotating an image. Python source code in comments!",
    "50":"I released the Code for the Instagram DeepFake Bot!",
    "51":"I made a ray tracer that simulates curved spacetime by using Einstein's field equations from general relativity. Here's a black hole!",
    "52":"I maDe a sCriPT thAT raNdOMlY cApiTAlIZes lEtTErs iN a SEntENcE",
    "53":"Replicating Face Mask Detection - OpenCV and MobileNetV2",
    "54":"I think it’s clear why I chose a Software Engineering career path instead of being an Artist",
    "55":"Trying to keep my Jump Rope and AI Skills on point! Made this application using OpenPose. Link to the Medium tutorial and the GitHub Repo in the thread.",
    "56":"I teach Python courses - here's my collection of about 1,000 slides on various Python topics, including data science (hosted on GitHub, licensed under CC-BY-SA)",
    "57":"The Python Mega Course is now free on Udemy",
    "58":"Because of quarantine and online clases I made some scripts to automatically connect to my zoom classes to get more sleep, I also configured my Mac to show old recording of me as a virtual cam in zoom so I don't have to attend early classes",
    "59":"My python image\/GIF glitching library is now on pypi!",
    "60":"Python Section at Foyle's, London",
    "61":"I made a Spotify ad stopper because I was too poor for Premium. It automatically detects when an ad plays and then restarts Spotify in the background. It's my first project after escaping tutorial hell and I'd love any feedback you guys have!",
    "62":"I was tired of opening 100s of tabs for internship apps. So, I made an app to scrape and apply to every single job listing on Glassdoor with one click using Selenium! (source code and YT video linked below)",
    "63":"Change text in place with custom hotkeys (Python Keyboard Listener)",
    "64":"Found this on twitter",
    "65":"I made a python drawing",
    "66":"Randomly Generate 69420 - Generate random 5-digit numbers until 69420 is generated",
    "67":"Fourier Series Visualizer in pygame.",
    "68":"Hexapod Robot Simulator with only Numpy and Plotly Dash",
    "69":"I made a project that generates the graph",
    "70":"How to quickly remove duplicates from a list?",
    "71":"Why would you want to use BeautifulSoup instead of Selenium?",
    "72":"My pothole detector. Used yolov3 annotated images on labelimg.",
    "73":"I made a fractal tree in python using turtle",
    "74":"I created a python script to generate color palettes from images (info + github link in comments)",
    "75":"Microsoft Considers Adding Python As an Official Scripting Language in Excel",
    "76":"Snake 4d - 4 spatial dimension game",
    "77":"PrettyErrors, a module to format exception reports",
    "78":"I'm working on a 2d N-body simulation using Python and Pygame",
    "79":"I created a series in Python that takes you through every detail step-by-step (code included) on how to create your own algorithmic trading bot that trades the financial and crypto markets for free.",
    "80":"A Command Line Stock Dashboard",
    "81":"We did it",
    "82":"These two books changed my life in 2018!",
    "83":"Happy 4th of July from Chicago",
    "84":"I created my first app, \"Timeglass\", a simple, unobtrusive menu bar timer for macOS.",
    "85":"Embedded Python: Build a Game on the BBC micro:bit – Real Python",
    "86":"I created a GUI that collates various interests of mine in one handy place",
    "87":"White Cuts Across Black Background - an effect achieved through good use of the Python Image Library",
    "88":"With my limited knowledge in Python, I wrote a simple script to control my motorized microscope from a keyboard. All instructions are open-source. Just wanted to share with this community for possible comments and suggestions for further improvements.",
    "89":"Lil cheatsheet",
    "90":"I made a course on NumPy. It got good reviews, but sales were weak so I'm releasing the entire thing for free.",
    "91":"Hello, world! I'm Al Sweigart, author of \"Automate the Boring Stuff with Python\" and several other programming books. AMA!",
    "92":"Spotlightify - a overlay controller for spotify, allowing you to quickly control your music without distraction. Please let me know if you are interested in this application as I am thinking of making it public on my github in the near future (once more features have been developed), thanks!",
    "93":"I wrote a python script that I'm running on my phone to play a word game called Ruzzle.",
    "94":"Started learning python today, Screw 'Hello World' , I'll start with 'Hello There'",
    "95":"xkcd: Python Environment",
    "96":"Work laptop doesn't allow minesweeper? I'm gonna build my own minesweeper, with blackjack, and hookers! In fact, forget the hookers!",
    "97":"I created a video about Neural Networks that is specifically aimed at Python developers! If you understand the Code, you understand how to create a Neural Network from Scratch! The video took me 200h to create and is fully animated! Hope it helps you guys :)",
    "98":"I created a python program for interactive batch cropping",
    "99":"Wrote a script that downloads r\/wallpaper's hottest 100 images and cycles through them as a wallpaper!"
  },
  "tokens":{
    "0":[
      0,
      1,
      2,
      3,
      4,
      5,
      6,
      7,
      8,
      9,
      10,
      11,
      12,
      13,
      14
    ],
    "1":[
      13,
      15,
      16
    ],
    "2":[
      17,
      18,
      19,
      3,
      20,
      5,
      21,
      22,
      23,
      24
    ],
    "3":[
      25,
      19,
      26,
      27,
      28,
      3,
      29
    ],
    "4":[
      30,
      31,
      32,
      33,
      34,
      35,
      36,
      37,
      38,
      39,
      3,
      1,
      40,
      41,
      19,
      42,
      43,
      44,
      8,
      45,
      46,
      47,
      48
    ],
    "5":[
      49,
      50,
      5,
      51,
      35,
      52,
      53,
      54,
      55,
      3,
      32,
      56,
      57,
      33,
      58,
      59,
      60,
      61,
      62,
      63,
      64,
      65,
      39,
      66
    ],
    "6":[
      67,
      68,
      69,
      28,
      70,
      71,
      72,
      73,
      74,
      39,
      75
    ],
    "7":[
      17,
      76,
      2,
      77,
      71,
      3,
      39,
      78,
      79,
      80,
      81,
      5,
      82
    ],
    "8":[
      83,
      5,
      84,
      85,
      35,
      86,
      67,
      87,
      16,
      88,
      89,
      90,
      33,
      91
    ],
    "9":[
      92,
      93,
      94
    ],
    "10":[
      30,
      95,
      5,
      96,
      2,
      97,
      98,
      39,
      3,
      33,
      13,
      99
    ],
    "11":[
      100,
      101,
      102,
      5,
      103,
      104,
      105,
      106,
      107,
      108,
      109
    ],
    "12":[
      110,
      111,
      112,
      113,
      114,
      115,
      33,
      116,
      56,
      108
    ],
    "13":[
      17,
      117,
      2,
      118,
      64,
      33,
      119,
      32,
      101,
      120,
      121,
      56,
      122,
      123
    ],
    "14":[
      124,
      125,
      126,
      127,
      3,
      128,
      28,
      129,
      33,
      130,
      56,
      131
    ],
    "15":[
      3,
      39,
      132,
      133
    ],
    "16":[
      110,
      76,
      2,
      134,
      135,
      136,
      137,
      25,
      71,
      3,
      4,
      138,
      139,
      140
    ],
    "17":[
      17,
      76,
      2,
      141,
      32,
      136,
      142,
      143,
      144,
      145,
      146,
      147,
      19,
      148,
      5,
      149,
      150,
      65,
      151,
      152,
      153,
      154,
      22,
      155,
      156,
      107,
      157,
      138,
      158,
      3,
      159,
      160,
      34
    ],
    "18":[
      19,
      161,
      162,
      5,
      163,
      2,
      164,
      138,
      165,
      166
    ],
    "19":[
      167,
      168,
      76,
      2,
      169,
      170,
      171,
      71,
      3,
      172,
      173
    ],
    "20":[
      3,
      174,
      5,
      175
    ],
    "21":[
      176,
      177,
      56,
      178,
      179,
      180,
      181,
      182,
      3,
      183
    ],
    "22":[
      184,
      185,
      186,
      5,
      181,
      32,
      39,
      3
    ],
    "23":[
      3,
      187,
      94,
      56,
      188
    ],
    "24":[
      2,
      3,
      189,
      56,
      190,
      19,
      191,
      192,
      102
    ],
    "25":[
      2,
      193,
      136,
      194,
      195,
      196,
      41,
      197,
      198,
      65,
      199,
      200,
      153,
      201,
      202,
      73,
      39,
      75
    ],
    "26":[
      3,
      159,
      136,
      203,
      204,
      205,
      206,
      207,
      76,
      71,
      208,
      209,
      33,
      210
    ],
    "27":[
      211,
      13,
      212,
      213
    ],
    "28":[
      214,
      2,
      215,
      5,
      216,
      217,
      218
    ],
    "29":[
      31,
      2,
      32,
      136,
      67,
      219,
      28,
      220
    ],
    "30":[
      3,
      39,
      2,
      221,
      222,
      5,
      223,
      22
    ],
    "31":[
      17,
      1,
      2,
      3,
      32,
      5,
      224,
      225,
      226,
      227,
      71,
      228,
      47
    ],
    "32":[
      17,
      76,
      101,
      229,
      230,
      56,
      231,
      232,
      233,
      227,
      234,
      235,
      236,
      22,
      224,
      90,
      237,
      238
    ],
    "33":[
      239,
      240,
      241,
      242,
      243,
      56,
      244
    ],
    "34":[
      35,
      245,
      246,
      247,
      248,
      249,
      250,
      17,
      76,
      251,
      136,
      160,
      252,
      39,
      253,
      138,
      2,
      94,
      254
    ],
    "35":[
      250,
      17,
      76,
      2,
      3,
      33,
      255,
      159,
      136,
      256,
      257,
      258,
      19,
      259,
      260,
      5,
      261,
      66,
      262,
      263,
      264,
      106,
      265
    ],
    "36":[
      17,
      117,
      50,
      5,
      51,
      35,
      266,
      53,
      54,
      3,
      62,
      56,
      184,
      33,
      267,
      268,
      269
    ],
    "37":[
      13,
      270,
      271
    ],
    "38":[
      76,
      101,
      272,
      3,
      4,
      136,
      273,
      2,
      274,
      138,
      275,
      276,
      19,
      277,
      278,
      279,
      280
    ],
    "39":[
      49,
      281,
      2,
      227,
      28,
      3,
      33,
      282
    ],
    "40":[
      17,
      76,
      101,
      283,
      284,
      5,
      21,
      285,
      56,
      84,
      286
    ],
    "41":[
      17,
      31,
      35,
      3,
      287,
      288,
      289,
      41,
      290,
      291,
      33,
      292,
      293,
      294
    ],
    "42":[
      13,
      15,
      16
    ],
    "43":[
      76,
      2,
      198,
      295,
      296,
      138,
      46,
      47,
      28,
      297,
      33,
      298
    ],
    "44":[
      2,
      32,
      136,
      299,
      199,
      101,
      300,
      301,
      22,
      302,
      107,
      303,
      304,
      39,
      305,
      41,
      19,
      306,
      307,
      56,
      308,
      309
    ],
    "45":[
      310,
      181,
      311,
      153,
      312,
      5,
      313,
      3,
      314,
      138,
      315
    ],
    "46":[
      101,
      316,
      138,
      3
    ],
    "47":[
      317
    ],
    "48":[
      318,
      35,
      52,
      319,
      199,
      2,
      281
    ],
    "49":[
      320,
      321,
      33,
      322,
      101,
      219,
      3,
      323,
      42,
      39,
      75
    ],
    "50":[
      17,
      324,
      19,
      42,
      56,
      283,
      285,
      284
    ],
    "51":[
      17,
      76,
      2,
      287,
      288,
      136,
      77,
      325,
      326,
      280,
      71,
      327,
      328,
      329,
      106,
      330,
      331,
      332,
      333,
      334
    ],
    "52":[
      17,
      76,
      2,
      4,
      136,
      335,
      336,
      337,
      39,
      338
    ],
    "53":[
      339,
      340,
      341,
      342,
      297,
      33,
      343
    ],
    "54":[
      17,
      154,
      22,
      344,
      345,
      346,
      2,
      347,
      348,
      349,
      350,
      351,
      41,
      352,
      101,
      353
    ],
    "55":[
      95,
      5,
      354,
      35,
      355,
      356,
      33,
      229,
      357,
      138,
      358,
      76,
      13,
      60,
      71,
      359,
      360,
      19,
      361,
      362,
      73,
      74,
      39,
      363
    ],
    "56":[
      17,
      364,
      3,
      365,
      332,
      35,
      366,
      41,
      367,
      368,
      138,
      369,
      370,
      371,
      105,
      59,
      372,
      73,
      373,
      374,
      375
    ],
    "57":[
      19,
      3,
      376,
      365,
      125,
      377,
      378,
      138,
      379
    ],
    "58":[
      145,
      41,
      380,
      33,
      381,
      382,
      17,
      76,
      383,
      4,
      5,
      384,
      385,
      35,
      386,
      387,
      149,
      23,
      388,
      389,
      390,
      391,
      392,
      393,
      9,
      238,
      199,
      2,
      394,
      395,
      39,
      250,
      146,
      147,
      396,
      397
    ],
    "59":[
      35,
      3,
      398,
      399,
      400,
      125,
      377,
      138,
      401
    ],
    "60":[
      3,
      402,
      403,
      404,
      405
    ],
    "61":[
      17,
      76,
      2,
      143,
      144,
      406,
      145,
      407,
      408,
      409,
      56,
      150,
      22,
      384,
      342,
      410,
      101,
      224,
      33,
      411,
      412,
      39,
      19,
      413,
      35,
      52,
      159,
      414,
      415,
      362,
      416,
      417,
      418,
      107,
      419,
      420,
      421,
      147
    ],
    "62":[
      17,
      407,
      422,
      41,
      423,
      424,
      425,
      56,
      426,
      102,
      250,
      76,
      101,
      5,
      427,
      33,
      428,
      429,
      430,
      319,
      431,
      138,
      432,
      28,
      132,
      433,
      71,
      434,
      323,
      42,
      435,
      436,
      360,
      437
    ],
    "63":[
      257,
      202,
      39,
      438,
      28,
      439,
      440,
      3,
      441,
      442
    ],
    "64":[
      443,
      13,
      138,
      444
    ],
    "65":[
      17,
      76,
      2,
      3,
      67
    ],
    "66":[
      335,
      330,
      445,
      446,
      447,
      448,
      125
    ],
    "67":[
      449,
      450,
      104,
      39,
      282
    ],
    "68":[
      451,
      452,
      77,
      28,
      161,
      453,
      33,
      454,
      455
    ],
    "69":[
      17,
      76,
      2,
      159,
      136,
      330,
      19,
      456
    ],
    "70":[
      186,
      5,
      457,
      458,
      459,
      106,
      2,
      431
    ],
    "71":[
      345,
      460,
      420,
      246,
      5,
      71,
      461,
      351,
      41,
      434
    ],
    "72":[
      35,
      462,
      463,
      71,
      464,
      465,
      219,
      138,
      466
    ],
    "73":[
      17,
      76,
      2,
      467,
      468,
      39,
      3,
      71,
      172
    ],
    "74":[
      17,
      96,
      2,
      3,
      4,
      5,
      330,
      263,
      469,
      106,
      219,
      470,
      73,
      360,
      39,
      75
    ],
    "75":[
      471,
      126,
      144,
      3,
      199,
      101,
      127,
      4,
      472,
      39,
      129
    ],
    "76":[
      473,
      134,
      474,
      475,
      227
    ],
    "77":[
      214,
      2,
      215,
      5,
      216,
      217,
      218
    ],
    "78":[
      49,
      476,
      138,
      2,
      134,
      477,
      77,
      71,
      3,
      33,
      282
    ],
    "79":[
      17,
      96,
      2,
      450,
      39,
      3,
      136,
      478,
      420,
      479,
      429,
      480,
      481,
      42,
      371,
      138,
      186,
      5,
      197,
      36,
      87,
      482,
      284,
      19,
      483,
      33,
      484,
      485,
      56,
      378
    ],
    "80":[
      2,
      486,
      487,
      488,
      489
    ],
    "81":[
      310,
      490,
      22
    ],
    "82":[
      491,
      492,
      54,
      257,
      35,
      493,
      39
    ],
    "83":[
      167,
      266,
      41,
      494,
      106,
      495
    ],
    "84":[
      17,
      96,
      35,
      52,
      102,
      496,
      2,
      497,
      498,
      499,
      500,
      501,
      56,
      502
    ],
    "85":[
      503,
      3,
      34,
      2,
      227,
      138,
      19,
      504,
      505,
      506
    ],
    "86":[
      17,
      96,
      2,
      189,
      136,
      507,
      369,
      508,
      41,
      509,
      39,
      132,
      510,
      438
    ],
    "87":[
      511,
      512,
      513,
      333,
      413,
      101,
      514,
      515,
      479,
      516,
      71,
      41,
      19,
      3,
      219,
      400
    ],
    "88":[
      28,
      35,
      517,
      518,
      39,
      3,
      17,
      1,
      2,
      497,
      4,
      5,
      45,
      519,
      520,
      106,
      441,
      40,
      521,
      522,
      120,
      30,
      246,
      51,
      13,
      523,
      56,
      524,
      75,
      33,
      525,
      526,
      527
    ],
    "89":[
      528,
      114
    ],
    "90":[
      17,
      76,
      2,
      365,
      138,
      453,
      22,
      318,
      516,
      529,
      153,
      530,
      531,
      532,
      250,
      49,
      324,
      19,
      533,
      534,
      56,
      378
    ],
    "91":[
      535,
      536,
      49,
      537,
      538,
      539,
      41,
      25,
      19,
      26,
      27,
      28,
      3,
      33,
      540,
      541,
      32,
      54,
      542
    ],
    "92":[
      543,
      2,
      544,
      45,
      56,
      143,
      545,
      420,
      5,
      457,
      197,
      546,
      547,
      548,
      549,
      550,
      238,
      551,
      552,
      522,
      508,
      39,
      13,
      60,
      199,
      17,
      117,
      154,
      41,
      21,
      22,
      553,
      138,
      35,
      73,
      19,
      554,
      555,
      556,
      23,
      48,
      147,
      557,
      281,
      83
    ],
    "93":[
      17,
      1,
      2,
      3,
      4,
      136,
      49,
      558,
      138,
      35,
      140,
      5,
      224,
      279,
      227,
      559,
      560
    ],
    "94":[
      181,
      81,
      3,
      561,
      562,
      535,
      536,
      563,
      28,
      564
    ],
    "95":[
      565,
      3,
      566
    ],
    "96":[
      476,
      567,
      568,
      545,
      569,
      49,
      570,
      571,
      34,
      35,
      36,
      28,
      572,
      33,
      573,
      39,
      574,
      575,
      19
    ],
    "97":[
      17,
      96,
      2,
      436,
      367,
      79,
      80,
      136,
      125,
      61,
      576,
      403,
      3,
      281,
      552,
      420,
      577,
      19,
      42,
      186,
      5,
      106,
      578,
      579,
      238,
      580,
      33,
      137,
      581,
      582,
      22,
      103,
      421
    ],
    "98":[
      17,
      96,
      2,
      3,
      32,
      56,
      583,
      584,
      585
    ],
    "99":[
      1,
      2,
      4,
      136,
      6,
      586,
      587,
      219,
      33,
      588,
      479,
      589,
      199,
      265
    ]
  }
}